import datetime
import logging
import os
import sys
import time
import traceback
import numpy as np
from timeit import default_timer as timer
from tkinter import messagebox
import keyring
import pandas as pd
import pyautogui as P
from selenium import webdriver
from selenium.webdriver.common.action_chains import ActionChains
from selenium.webdriver.common.by import By
from selenium.webdriver.support import expected_conditions as EC
from selenium.webdriver.support.wait import WebDriverWait
import pyperclip
import re
trimmed_list = []
extracted = ['|Разбивка на търсенията|1|linson moto|5 797|2|мото екипировка|1 209|3|linsonmoto|1 167|4|линсон мото|1 '
             '105|5|мотори|1 036|6|moto|871|7|linson|655|8|каски|622|9|мото каски|556|10|мото|480|11|мото '
             'екип|412|12|мото аксесоари|411|13|dainese|386|14|части за мотори|350|15|мото '
             'магазин|317|16|motori|293|17|мото магазин софия|290|18|Linson Moto - Moto Ekip София|282|19|Linson Moto '
             '- Moto Ekip, улица „проф. Кирил Попов, Sofia|223|20|nula bike|204|21|каски за мотори|202|22|линсън '
             'мото|196|23|Linson Moto - Moto Ekip, улица „проф. Кирил Попов, София|195|24|мото яке|174|25|мото '
             'якета|174|26|moto moto|147|27|motoekip|144|28|магазин за мотори|137|29|Мото магазин софия|125|30|mv '
             'agusta|120|31|moto bg|119|32|линсон|118|33|мото части|117|34|moto ekip|104|35|moto kaski|102|36|Мото '
             'екипировка|99|37|магазин за мотори софия|99|38|линсонмото|92|39|agv|91|40|мото облекло|89|41|магазин за '
             'мото екипировка|81|42|мото обувки|80|43|Linson moto|77|44|linson moto bg|74|45|аксесоари за '
             'мотор|70|46|мотори втора ръка|70|47|Linson Moto - Moto Ekip|65|48|екип|64|49|shark '
             'helmet|62|50|alpinestars|59|51|oneal екипировка|54|52|акумулатор за '
             'мотор|50|53|мотокрос|50|54|linsonmoto.bg|48|55|мото софия|46|56|moto ekipirovka|43|57|мото '
             'каска|42|58|linson moto работно време|41|59|аксесоари за мотори|40|60|мото гуци|38|61|lube|37|62|Мото '
             'каски|37|63|мотокрос екипировка|37|64|alpinestar|35|65|mt helmets|35|66|ekip|34|67|мото магазин '
             'студентски град|34|68|мотоциклети|34|69|Linson Moto - Moto Ekip, улица „Професор Кирил Попов“, '
             'София|34|70|Linson Moto - Moto Ekip, улица „Професор Кирил Попов“, Sofia|33|71|moto '
             'magazin|32|72|kaski|28|73|arai helmets|27|74|nula. bike|26|75|турър '
             'мотори|25|76|магазин|23|77|кавазаки|22|78|Moto|21|79|moto bulgaria|21|80|moto.bg|21|81|Bata магазини '
             'софия|20|82|djigit shop|20|83|moto guzzi|20|84|линсон мото-софия|19|85|vemar helmets|18|86|каски за '
             'мотор|18|87|магазин за каски софия|18|88|магазин за мото екипировка софия|18|89|моточасти '
             'софия|18|90|arai helmet|17|91|linson Moto|17|92|Части за мотори втора ръка|17|93|мото аксесоари '
             'софия|17|94|мотоциклети втора '
             'ръка|17|95|моточасти|17|96|airoh|16|97|bardahl|16|98|viper|16|99|акумулатори|16|100|магазин за мото '
             'аксесоари|16|101|мото панталон|16|102|ризница|16|103|части за мотори втора ръка|16|104|лисон '
             'мото|16|105|фазер|16|106|7f|< 15|107|AGV|< 15|108|AIROH SPARK|< 15|109|Ads Акумулатори|< 15|110|Arai '
             'Helmet|< 15|111|Dainese|< 15|112|Dainese & AGV Bulgaria|< 15|113|Honda Vt|< 15|114|K-5 S AGV E2205 '
             'MARBLE|< 15|115|Kawazaki части за мотори|< 15|116|LIMSON MOTO|< 15|117|LINSON|< 15|118|LINSON MOTO|< '
             '15|119|LINSONMOTO|< 15|120|LUBE|< 15|121|Linson|< 15|122|Linson Moto|< 15|123|Linson Moto - Moto Ekip, '
             '46, София|< 15|124|Linson Moto - Moto Ekip, улица „проф. Кирил Попов, Sofia, Bulgaria|< 15|125|Linson '
             'Moto - Moto Ekip, улица „проф. Кирил Попов, Sofya|< 15|126|Linson Moto - Moto Ekip, улица „проф. Кирил '
             'Попов“ 46, 1700 София, Bulgaria|< 15|127|LinsonMoto|< 15|128|Linsonmoto|< 15|129|MOTO|< 15|130|Moto '
             'Bulgaria|< 15|131|Moto Moto|< 15|132|Moto bg|< 15|133|Moto dar|< 15|134|MotorCo Ltd.|< 15|135|Motorcycle '
             'showroom|< 15|136|Motori|< 15|137|Motorrad shop varna|< 15|138|Multitech sofia|< 15|139|Nula Bike|< '
             '15|140|Shark Speed-R|< 15|141|Supermoto|< 15|142|YTX9-BS|< 15|143|Yamaha Motor Bulgaria|< 15|144|a-pro|< '
             '15|145|accessories sofia moto|< 15|146|agu baloon|< 15|147|agv helmet|< 15|148|agv helmets|< 15|149|agv '
             'k1|< 15|150|agv k3|< 15|151|agv каска|< 15|152|airoh twist linsonmoto|< 15|153|alpine star|< '
             '15|154|alpinestars andes v2 drystar|< 15|155|alpinestars boots|< 15|156|alpinestars neck brace bns pro|< '
             '15|157|alpinestars tech 3|< 15|158|alpinestars мотокрос долно|< 15|159|alpinstar bulgaria|< '
             '15|160|arai|< 15|161|arlen ness|< 15|162|badges|< 15|163|bardahl 10w50|< 15|164|bardahl atv 10w40|< '
             '15|165|bardahl tyre sealant|< 15|166|bardahl софия|< 15|167|bata магазини софия|< 15|168|bell каски|< '
             '15|169|berik|< 15|170|bmw мотори|< 15|171|bmw мотоциклети|< 15|172|caberg|< 15|173|caberg helmets|< '
             '15|174|cafe racer|< 15|175|chasti|< 15|176|chasti za motori|< 15|177|cross motorbike|< 15|178|custom '
             'fit|< 15|179|dainese bulgaria|< 15|180|dainese gore tex 20 000|< 15|181|dainese motorcycle|< '
             '15|182|dainese store|< 15|183|dainese протектори|< 15|184|dainesemoto|< 15|185|daineze|< '
             '15|186|decathlon|< 15|187|decathlon яьтш|< 15|188|deinese|< 15|189|ducati|< 15|190|edimoto|< 15|191|fox '
             'каски|< 15|192|full face|< 15|193|g moto|< 15|194|gas shoes|< 15|195|gasgas sofia|< 15|196|general '
             'motors|< 15|197|golf ekip|< 15|198|gym wear|< 15|199|hina i moto kaski|< 15|200|hjc|< 15|201|hjc '
             'helmet|< 15|202|hjc helmets|< 15|203|holeshot|< 15|204|honda bike|< 15|205|honda cbр125|< 15|206|honda '
             'nc|< 15|207|honda pistov|< 15|208|honda мотори|< 15|209|icon airflite|< 15|210|icon airflite electro '
             'black|< 15|211|icon helmet|< 15|212|icon helmets|< 15|213|icon moto|< 15|214|icon motorcycle|< '
             '15|215|ilusion|< 15|216|ilusion®|< 15|217|ivo moto|< 15|218|ivomoto|< 15|219|kaska za motor|< '
             '15|220|kaski za motocikleti|< 15|221|kaski za motori|< 15|222|kawasaki|< 15|223|kawasaki sofiq magazin '
             'za novi motori|< 15|224|ktm wibracii|< 15|225|kкаска ъа мотор biltwell|< 15|226|l i m moto|< '
             '15|227|lenson moto|< 15|228|limson moto|< 15|229|lindon moto|< 15|230|lindson moto|< 15|231|linon moto|< '
             '15|232|lins moto|< 15|233|linsan moto|< 15|234|linsanmoto|< 15|235|linsen moto|< 15|236|linsenmoto|< '
             '15|237|linsmoto|< 15|238|linso moto|< 15|239|linsomoto|< 15|240|linson moto kaski|< 15|241|linson moto '
             'kaski 2ra ruka|< 15|242|linson moto sofia|< 15|243|linson moto контакти|< 15|244|linson moto наколенки|< '
             '15|245|linson moto студентски град|< 15|246|linson moto.bg|< 15|247|linson motor|< 15|248|linson '
             'motors|< 15|249|linson motot|< 15|250|linsonkoto|< 15|251|lionson moto|< 15|252|lisanmoto|< '
             '15|253|lisenmoto|< 15|254|lision moto|< 15|255|lison moto|< 15|256|lisonmoto|< 15|257|lisunmoto|< '
             '15|258|lonson moto|< 15|259|lrnson moto|< 15|260|lynson moto|< 15|261|lyson moto|< 15|262|magazin za '
             '4asti za motori|< 15|263|magazin za motori|< 15|264|magazin za motori do kat sofia|< 15|265|malaguti|< '
             '15|266|mcb757si|< 15|267|metzeler|< 15|268|michelin|< 15|269|michelin tires motorcycle|< 15|270|mioto '
             'sofia|< 15|271|motex аксесоари за мотори|< 15|272|moto 59|< 15|273|moto Sofia|< 15|274|moto aksesoari|< '
             '15|275|moto angliiski|< 15|276|moto chasti|< 15|277|moto chsti.bg|< 15|278|moto cross bulgaria|< '
             '15|279|moto ekipi ixs|< 15|280|moto ekipirovka sofia|< 15|281|moto ekipirowka|< 15|282|moto guzzi bg|< '
             '15|283|moto house|< 15|284|moto kaska|< 15|285|moto kros|< 15|286|moto linson|< 15|287|moto magazin bg|< '
             '15|288|moto magazin sofia|< 15|289|moto magazini|< 15|290|moto magesin|< 15|291|moto parts sofija '
             'suzuki|< 15|292|moto qke|< 15|293|moto ranica|< 15|294|moto razors|< 15|295|moto sofia|< 15|296|moto '
             'store bg|< 15|297|moto studentski|< 15|298|moto екип|< 15|299|moto кевларено яке лятно|< 15|300|moto '
             'магазин|< 15|301|moto масло|< 15|302|moto части|< 15|303|motobg|< 15|304|motocross helmet|< '
             '15|305|motocross ochila|< 15|306|motocross екипировка|< 15|307|motoekip studentski grad|< '
             '15|308|motogumi|< 15|309|motokaski|< 15|310|motokaski i vizori|< 15|311|motomagazin|< 15|312|motomoto|< '
             '15|313|motorbike щампи|< 15|314|motorbikes sofia|< 15|315|motorcycle|< 15|316|motorcycle helmet|< '
             '15|317|motorcycle shop sofia|< 15|318|motorcycle shops|< 15|319|motori huskqvarna|< 15|320|motos|< '
             '15|321|motul 7100 15w50|< 15|322|motul магазин|< 15|323|mt helmet|< 15|324|muto maslo|< 15|325|my moto|< '
             '15|326|nani magazini|< 15|327|nolan helmets|< 15|328|nolan каски|< 15|329|nula.bike|< 15|330|o neal|< '
             '15|331|o\'neal|< 15|332|o\'neal екипировка|< 15|333|oneal motocross gear sofia|< 15|334|oneal каски|< '
             '15|335|oxford motorcycle|< 15|336|pinlock|< 15|337|pleven motocross|< 15|338|predpazna ekipirowka|< '
             '15|339|probiker|< 15|340|putoline|< 15|341|quicksilver|< 15|342|raptor service|< 15|343|richa|< '
             '15|344|richa moto|< 15|345|scorpion exo|< 15|346|scorpion helmets|< 15|347|second hand bike store '
             'sofia|< 15|348|shad bc02|< 15|349|shad bg|< 15|350|shark helmets|< 15|351|shark ridil|< 15|352|shark '
             'spartan carbon|< 15|353|sherco пластмаси|< 15|354|shoei helmet|< 15|355|shoei helmets|< 15|356|shoei '
             'nxr|< 15|357|shokar обувки|< 15|358|sidi ботуши|< 15|359|simpson helmets|< 15|360|spidi motorcycle|< '
             '15|361|sport moto|< 15|362|srwiz za motori darwenica|< 15|363|sunset гуми|< 15|364|super moto|< '
             '15|365|supermoto|< 15|366|supra|< 15|367|suzuki gsf 1200 dr|< 15|368|svesh ngk|< 15|369|the underdog '
             'shop|< 15|370|tomi ekipirovka|< 15|371|top case|< 15|372|troy lee designs|< 15|373|uh екипировка|< '
             '15|374|ulitsa "Professor Kiril Popov" 46 1700 Studentski grad, Sofia Bulgaria|< 15|375|vemar|< '
             '15|376|vespa|< 15|377|white supermatic|< 15|378|xmotos 250 магазин цена|< 15|379|yuasa ytz10s|< '
             '15|380|yuasa акумулатори|< 15|381|zmoto|< 15|382|Гелови акумулатори за мотори|< 15|383|Готов електролит '
             'за акумулатори|< 15|384|ЕДИмотоцентър|< 15|385|ЕКИП|< 15|386|Екипировка за мотокрос|< 15|387|Интерком '
             'комплект|< 15|388|КАСКИ МОТОР|< 15|389|Каски|< 15|390|Крачоли екипировка|< 15|391|Кросова екипировка|< '
             '15|392|МОТО|< 15|393|МОТО КАСКИ|< 15|394|Магазин за каски|< 15|395|Магазин за каски софия|< '
             '15|396|Магазин за мотори софия|< 15|397|Магазин за мотоциклети|< 15|398|Магазин за пистови мотори|< '
             '15|399|Магазин за симсон в софия|< 15|400|Магазини Voyager|< 15|401|Мото|< 15|402|Мото аксесоари|< '
             '15|403|Мото аксесоари софия|< 15|404|Мото боне|< 15|405|Мото екип|< 15|406|Мото екипировка плевен|< '
             '15|407|Мото интерком|< 15|408|Мото куфари багажници|< 15|409|Мото магазин|< 15|410|Мото магазин '
             'хулиган|< 15|411|Мото магазини|< 15|412|Мото софия|< 15|413|Мото яке|< 15|414|Мото якета|< 15|415|Мото '
             'якета втора ръка|< 15|416|Мото якета втора употреба|< 15|417|Мотор марки|< 15|418|Мотори|< '
             '15|419|Мотоциклети aprilia|< 15|420|Мотоциклетни ботуши|< 15|421|Резервни части за мотоциклети|< '
             '15|422|Резервни части за руски мотоциклети|< 15|423|Резервни части за скутери априлия|< 15|424|Ремонт на '
             'мото каски|< 15|425|Студентски град; Кирил Попов 46|< 15|426|Турър мотори|< 15|427|Ул. „Проф. Кирил '
             'Попов“ 46|< 15|428|Части за мотори|< 15|429|Части за мотори софия|< 15|430|Части за симсон благоевград|< '
             '15|431|ЯКЕТА ADRENALINE|< 15|432|авточасти|< 15|433|авточасти втора ръка|< 15|434|авточасти студентски|< '
             '15|435|авточасти студентски град|< 15|436|агв|< 15|437|аксесоари за cros еуфория|< 15|438|акумулатор|< '
             '15|439|акумулатор yuasa|< 15|440|акумулатор и батерии софия|< 15|441|акумулатори за мотор|< '
             '15|442|акумулатори за мотори|< 15|443|акумулатори за мотори софия|< 15|444|акумулатори студентски град|< '
             '15|445|алпинстар|< 15|446|алпинстар магазин|< 15|447|американски автомобили|< 15|448|атв под наем|< '
             '15|449|бмв мотори|< 15|450|бричоле|< 15|451|върта|< 15|452|г мото|< 15|453|газов инжекцион 8 цилиндъра '
             'софия|< 15|454|гащеризонен екип motoriski|< 15|455|гекко бг софия|< 15|456|град София, ул. „проф. Кирил '
             'Попов“ 46|< 15|457|гуми|< 15|458|гуми за мотор|< 15|459|гуми софт гел|< 15|460|даинесе|< '
             '15|461|дайнезе|< 15|462|дайнезе мото|< 15|463|декатлон обувки с колелца 40 номер|< 15|464|детска мото '
             'екипировка|< 15|465|детски каски за мотори|< 15|466|детски мото каски|< 15|467|дид партс|< 15|468|дрехи '
             'за мотористи|< 15|469|дрехи и аксесоари мотор хускварна|< 15|470|еди мото|< 15|471|едимоторс|< '
             '15|472|екип за мотор|< 15|473|екипировка за атв|< 15|474|екипировка за кросов мотор|< 15|475|екипировка '
             'за мотокрос|< 15|476|екипировка за мотор|< 15|477|екипировка за мотори|< 15|478|екипировка за пистов '
             'мотор|< 15|479|екипировки за мотори|< 15|480|ендуро|< 15|481|жекакски|< 15|482|жила за мотори софия|< '
             '15|483|за мотор|< 15|484|за мотори|< 15|485|забрана.за.мотоциклети.в.центъра|< 15|486|зарядно за '
             'акумулатор|< 15|487|зимни гуми кога се слагат|< 15|488|иво мото|< 15|489|имали магазин за части на мотор '
             'в раеона|< 15|490|индиан мотори|< 15|491|каска|< 15|492|каска vespa|< 15|493|каска за мотор софия|< '
             '15|494|каска мото|< 15|495|каски caberg цени|< 15|496|каски schuberth|< 15|497|каски за колело|< '
             '15|498|каски за мотор магазин софия|< 15|499|каски за мотори agv|< 15|500|каски за мотори цени|< '
             '15|501|каски за скутери|< 15|502|кирил попов|< 15|503|кирил попов 46|< 15|504|кожен екип за мотор|< '
             '15|505|кожено яке|< 15|506|колко задвижващи колела има тир|< 15|507|кормило за мотор dragbar|< '
             '15|508|костюм за мотор|< 15|509|крос екипировка|< 15|510|кросова екипировка|< 15|511|къски|< 15|512|къща '
             'за мотори София|< 15|513|линс мото|< 15|514|линсан мото|< 15|515|линсен мото|< 15|516|линсо мото|< '
             '15|517|линсон мото бг|< 15|518|линсон мото работа|< 15|519|линсон мото работно време|< 15|520|линсон '
             'мото студентски град|< 15|521|линсън мото работно време|< 15|522|лисан мото|< 15|523|лисон moto.bg|< '
             '15|524|лисън мото|< 15|525|магазин МОТО МЕГА|< 15|526|магазин априлия|< 15|527|магазин дид содия|< '
             '15|528|магазин за Симсон в София|< 15|529|магазин за автоаксесоари|< 15|530|магазин за авточасти|< '
             '15|531|магазин за аксесоари за мотор|< 15|532|магазин за аксесоари за мотори София|< 15|533|магазин за '
             'дрехи студентски град|< 15|534|магазин за екипировка на мотори в България|< 15|535|магазин за каски|< '
             '15|536|магазин за кафе студентски град|< 15|537|магазин за кросови мотори|< 15|538|магазин за кросови '
             'мотори софия|< 15|539|магазин за металисти софия|< 15|540|магазин за мото аксесоари софия|< '
             '15|541|магазин за мото каски|< 15|542|магазин за мото облекло|< 15|543|магазин за мото части|< '
             '15|544|магазин за мотоеи|< 15|545|магазин за мотокрос екипировка|< 15|546|магазин за мотори дружба|< '
             '15|547|магазин за мотори студентски град|< 15|548|магазин за пистови мотори|< 15|549|магазин за симсон в '
             'софия|< 15|550|магазин за спортни мотори|< 15|551|магазин за части за мотори|< 15|552|магазин за шлемове '
             'софия|< 15|553|магазин мото екипировка|< 15|554|магазин мотори|< 15|555|магазин мотоциклети|< '
             '15|556|магазини за въздушни филтри софия|< 15|557|магазини за кросови мотори|< 15|558|магазини за мото '
             'аксесоари софия|< 15|559|магазини за мото екипировка|< 15|560|магазини за мото екипировка в софия|< '
             '15|561|магазини за мото каски|< 15|562|магазини за мото части|< 15|563|магазини за мотокрос и ATV '
             'каски|< 15|564|магазини за мотори|< 15|565|магазини за мотори софия|< 15|566|магазини студентски град|< '
             '15|567|магашин студ град мото аксесоари|< 15|568|майстор на мотори|< 15|569|масла за мотори|< '
             '15|570|масла за мотоциклети|< 15|571|мото София|< 15|572|мото аксесоари трета градска|< 15|573|мото '
             'антифриз|< 15|574|мото боне|< 15|575|мото гуми|< 15|576|мото гуми втора ръка китаеца|< 15|577|мото гуми '
             'софия|< 15|578|мото дрехи втора употреба|< 15|579|мото екип втора ръка|< 15|580|мото екипи abmr|< '
             '15|581|мото екипировка втора ръка студентски град|< 15|582|мото екипировка втора употреба|< 15|583|мото '
             'екипировка пазарджик|< 15|584|мото екипировка плевен|< 15|585|мото екипировка студентски град|< '
             '15|586|мото екипировкащ|< 15|587|мото експрес|< 15|588|мото каски agv|< 15|589|мото каски софия|< '
             '15|590|мото клубове|< 15|591|мото кожени якета|< 15|592|мото костюм|< 15|593|мото крос|< 15|594|мото '
             'крос екипировка|< 15|595|мото магазин в софия|< 15|596|мото магазин младост|< 15|597|мото магазини|< '
             '15|598|мото магазини софия|< 15|599|мото маска|< 15|600|мото масла|< 15|601|мото мол|< 15|602|мото '
             'мото|< 15|603|мото мото България|< 15|604|мото наколенки|< 15|605|мото облекло lofer|< 15|606|мото '
             'панталони|< 15|607|мото протектори|< 15|608|мото раници|< 15|609|мото спортове|< 15|610|мото студентски '
             'град|< 15|611|мото чанти|< 15|612|мото части софия|< 15|613|мото якета втора ръка|< 15|614|мото якета '
             'дайнези|< 15|615|мотогуми|< 15|616|мотоекип|< 15|617|мотокаски|< 15|618|мотокрос екипировка втора '
             'употреба|< 15|619|мотокрос магазин|< 15|620|мотокрос софия|< 15|621|мотор|< 15|622|мотор сайкъл инддиан '
             'моторо|< 15|623|мотор студентски град|< 15|624|мотор тирумф|< 15|625|моторджийски обувки|< 15|626|мотори '
             'бмв|< 15|627|мотори втора ръка софия|< 15|628|мотори втора употреба|< 15|629|мотори жоро симеон|< '
             '15|630|мотори зеро|< 15|631|мотори индиан|< 15|632|мотори мотори|< 15|633|мотори мотори мотори|< '
             '15|634|мотори на части|< 15|635|мотори студентски град|< 15|636|мотори части|< 15|637|мотоциклетен тур '
             'екипировка|< 15|638|мотоэкипировка|< 15|639|мус 140|< 15|640|мъ мото|< 15|641|най-добър сервиз турбо '
             'софия|< 15|642|наклатки|< 15|643|наколенки alpinestars|< 15|644|неизправностти в мотори honda|< '
             '15|645|нови кожени Мото якета рича|< 15|646|нови мото каски|< 15|647|облекло за мотор|< 15|648|облекло '
             'за мотористи|< 15|649|огледала за мотор София|< 15|650|осветление крушка|< 15|651|офроуд части|< '
             '15|652|перфект мафазин|< 15|653|поправка на скутери|< 15|654|пробка|< 15|655|продавам магазин за '
             'авточасти|< 15|656|промоции акумулатори|< 15|657|пружина|< 15|658|путолайн|< 15|659|работно облекло|< '
             '15|660|ракъвици мотор загряващи|< 15|661|резервни гуми за ръкохватки|< 15|662|резервни части за '
             'мотоциклети|< 15|663|резервоар|< 15|664|ремонт на карбуратори|< 15|665|ремонт на мото каски|< '
             '15|666|ретро мотоаксесоари|< 15|667|рицха|< 15|668|сервиз за смяна на хидравлична течност софия|< '
             '15|669|ски протектор|< 15|670|смяна на акумулатор|< 15|671|смяна на гуми|< 15|672|смяна на масло|< '
             '15|673|смяна на мото крос гуми|< 15|674|спирачна течност|< 15|675|спортен магазин ски|< '
             '15|676|спортивные товары|< 15|677|спортни екипи|< 15|678|спортни мотори|< 15|679|средни мотори|< '
             '15|680|строителни каски|< 15|681|студентски град мото екипи|< 15|682|термо облекло за мотористи|< '
             '15|683|тех визион втора|< 15|684|технически преглед|< 15|685|технически преглед софия|< '
             '15|686|технически преглед студентски град|< 15|687|тол бг|< 15|688|толбг|< 15|689|толи ауто|< '
             '15|690|триумф дейтона 955 отзиви|< 15|691|триумф мотор|< 15|692|туристически мотори|< 15|693|турър '
             'екипировка|< 15|694|ул. проф. кирил попов no 5|< 15|695|фантастико|< 15|696|хотел за мотори асен '
             'реклама|< 15|697|части|< 15|698|части moto дружба софия|< 15|699|части втора ръка|< 15|700|части за атв '
             'софия|< 15|701|части за електро мотори софия|< 15|702|части за мотор|< 15|703|части за мотори kymco|< '
             '15|704|части за мотори софия|< 15|705|части за мотори тмакс|< 15|706|части за мотоциклети|< 15|707|части '
             'за мотоциклети софия|< 15|708|части кавазаки|< 15|709|части мотори|< 15|710|части мотоциклети|< '
             '15|711|части на мотор|< 15|712|червена верига дид|< 15|713|шлемове магазин софия|< 15|714|шлемове '
             'магазин софия|< 15|715|якета за мотористи|< 15|716|японски магазин|< 15 ']

list_page_indexes = np.array(["100", "200", "300", "400", "500", "600", "700", "800", "900", "1000",
                     "1100", "1200", "1300", "1400", "1500", "1600", "1700", "1800",
                     "1900", "2000", "2100", "2200", "2300", "2400", "2500", "2600", "2700", "2800",
                     "2900", "3000", "3100", "3200", "3300", "3400", "3500", "3600", "3700", "3800", "3900", "4000"])

list_one = [l.split('|') for l in '|'.join(extracted).split('|')]
list_one.pop(0)
list_one.pop(0)
# print(list_one)
index = list_one[0::3]
search = list_one[1::3]
volume = list_one[2::3]
while True:
    list_index = []
    list_index.append(index)
    np_list_index = np.array(list_index)
    # print(np_list_index)
    messagebox.showinfo("Pause!")
    if np_list_index not in list_page_indexes:
        print(f"Current index is: {index[-1][0]}")
        print("Yes!")
    else:
        print("No!")
        break
